rotationPlate/case/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0288;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           $internalField;        
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           $internalField;        
    }

    "(wall_fan|fan|wall_inlet|wall_outlet)"
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    "(AMI1_1|AMI1_2|AMI2_1|AMI2_2)"
    {
        type            cyclicAMI;
        value           $internalField;
    }
}


// ************************************************************************* //
