rotationPlate/case/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2887.03;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;        
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           $internalField;        
    }

    "(wall_fan|fan|wall_inlet|wall_outlet)"
    {
        type            omegaWallFunction;
        value           $internalField;        
    }

    "(AMI1_1|AMI1_2|AMI2_1|AMI2_2)"
    {
        type            cyclicAMI;
        //value           $internalField;
    }

}


// ************************************************************************* //
