rotationPlate/case/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    AMI1_1 
    {
        type            cyclicAMI;
        matchTolerance  0.001;
        transform       noOrdering;
        neighbourPatch  AMI1_2;

    }

    AMI1_2 
    {
        type            cyclicAMI;
        matchTolerance  0.001;
        transform       noOrdering;
        neighbourPatch  AMI1_1;
    }

    AMI2_1 
    {
        type            cyclicAMI;
        matchTolerance  0.001;
        transform       noOrdering;
        neighbourPatch  AMI2_2;

    }

    AMI2_2 
    {
        type            cyclicAMI;
        matchTolerance  0.001;
        transform       noOrdering;
        neighbourPatch  AMI2_1;
    }



    "(wall_fan|fan|wall_inlet|wall_outlet)"
    {
        type            wall;
    }



}


// ************************************************************************* //
